app/Controllers/Api.php

    public function getJurusan()
    {

        $jurusan = $this->jurusanModel->findall();

        $daftarjurusan = [];

        foreach ($jurusan as $value) {
            $daftarjurusan[$value['id_jurusan']] = 0;
        };

        foreach ($this->request->getVar() as $key => $value) {
            $idpertanyaan = $this->pertanyaanjurusanModel->where('id_pertanyaan', str_replace('radio', '', $key))->get()->getResultArray();
            foreach ($idpertanyaan as $pertanyaan) {
                if ($value == "yes") {
                    $daftarjurusan[$pertanyaan['id_jurusan']] += $pertanyaan['nilai_pertanyaan'];
                }
            }
        };

        $maxjurusan = array_search(max($daftarjurusan), $daftarjurusan);

        $hasiljurusan = $this->jurusanModel->where('id_jurusan', $maxjurusan)->get()->getResultArray()[0];
---
SELECT *
FROM `jurusan`
SELECT *
FROM `jurusan`
WHERE `id_jurusan` = 2