app/Controllers/Pages.php

SELECT *
FROM `jurusan`
SELECT *
FROM `team`
---
    public function index()
    {
        $jurusan = $this->jurusanModel->findall();
        $team = $this->teamModel->findall();

SELECT *
FROM `jurusan`
SELECT *
FROM `team`
SELECT *
FROM `pertanyaan`
---
    public function main()
    {
        $jurusan = $this->jurusanModel->findall();
        $team = $this->teamModel->findall();
        $pertanyaan = $this->pertanyaanModel->findall();